---
kind: enumMember
id: F:Autodesk.Revit.DB.WorksetConfigurationOption.CloseAllWorksets
enum: Autodesk.Revit.DB.WorksetConfigurationOption
source: html/2fe5f0c1-c4c7-ea97-541c-5ee61b397dce.htm
---
# Autodesk.Revit.DB.WorksetConfigurationOption.CloseAllWorksets

Close all user-created worksets by default. Additional close requests will be ignored for this type of configuration.